welcome_text = [
        ("Развитие информационного общества предполагает внедрение цифровых технологий во все сферы жизни, "
         "но это означает и появление новых угроз безопасности – от утечек информации до кибертерроризма.", False),
        ('''
            В проекте Концепции стратегии кибербезопасности Республики Казахстан киберпространство определяется как 
        «сфера деятельности в информационном пространстве, образованная совокупностью Интернета и других 
        телекоммуникационных сетей и любых форм осуществляемой посредством их использования человеческой активности 
        (личности, организации, государства)», а кибербезопасность – как «совокупность условий, при которых все 
        составляющие киберпространства защищены от максимально возможного числа угроз и воздействий с нежелательными 
        последствиями». В связи с этим большое значение приобретает проблема «культуры безопасного поведения в 
        киберпространстве». 
            В соответствии со «Стратегией развития отрасли цифровых технологий в Республики Казахстан на перспективу 
        до 2030 года» и рядом других документов в числе многих других задач выделяются: обеспечение различных 
        сфер экономики качественными цифровыми технологиями; обеспечение высокого уровня информационной 
        безопасности государства, индустрии и граждан. 
            Безопасность в информационном обществе является одним из основных направлений фундаментальных исследований в 
        области цифровых технологий. Компьютерные технологии применяются при изучении практически всех дисциплин, поэтому, 
        как указано в «Стратегии развития отрасли цифровых технологий в Республики Казахстан»: «Необходимо 
        совершенствовать современную профессиональную подготовку всех специальностей, в том числе учителей информатики 
        и преподавателей дисциплин в сфере информационных технологий», а значит, и в сфере кибербезопасности.  
        Киберугрозы существуют везде, где применяются цифровые технологии, следовательно, студенты, изучая любую 
        дисциплину может в профессиональной деятельности столкнуться и со спамом, и с вирусами, и со взломом компьютера 
        и с многими другими проблемами, на которые нужно не только оперативно реагировать, но и насколько возможно 
        уметь предотвращать их появление, а значит, постоянно упоминать в контексте урока различные аспекты организации 
        информационной безопасности. Студент должен иметь представление о современном уровне развития вычислительной 
        техники, информационный сетей, технологий коммуникации и навигации. 
            Целей курса – обеспечение получение знаний и навыков, охватывающих все области кибербезопасности — 
        информационную безопасность, безопасность систем и сетей, безопасность мобильных устройств, физическую 
        безопасность, этические и правовые требования, технологии и методы защиты и минимизации последствий в 
        ходе обеспечения информационной безопасности.  
            Задача курса - совершенствование высшего образования и подготовки в сфере информационной безопасности, а 
        также популяризация профессий, связанных с информационными технологиями.  Электронный учебник по дисциплине 
        «Кибербезопасность» обеспечивает подготовку студентов, обучающихся по специальностям: "для всех специальностей» 
            В электронном учебнике раскрываются цели, принципы информационной безопастности. Наряду с изложением общих 
        вопросов кибербезопастности рассматриваются задачи криптографии.''', False),
        ("В связи с этим большое значение приобретает проблема «культуры безопасного поведения в киберпространстве».",
         True),
    ]